ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/asflib/rtc.c
/**
 * \file
 *
 * \brief Real-Time Clock (RTC) driver for SAM.
 *
 * Copyright (c) 2011-2020 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */

/*
 * Support and FAQ: visit <a href="https://www.microchip.com/support/">Microchip Support</a>
 */

#include "pic32cx.h"
#include "rtc.h"

/* / @cond 0 */
/**INDENT-OFF**/
#ifdef __cplusplus
extern "C" {
#endif
/**INDENT-ON**/
/* / @endcond */

/**
 * \defgroup sam_drivers_rtc_group Real-Time Clock (RTC)
 *
 * See \ref sam_rtc_quickstart.
 *
 * The RTC provides a full binary-coded decimal (BCD) clock that includes
 * century (19/20), year (with leap years), month, date, day, hour, minute
 * and second.
 *
 * @{
 */

/* RTC Write Protect Key "RTC" in ASCII */
#define RTC_WP_KEY     (0x525443)

/* The BCD code shift value */
#define BCD_SHIFT      4

/* The BCD code mask value */
#define BCD_MASK       0xfu

/* The BCD mul/div factor value */
#define BCD_FACTOR     10

/**
 * \brief Set the RTC hour mode.
 *
 * \param p_rtc Pointer to an RTC instance.
 * \param ul_mode 1 for 12-hour mode, 0 for 24-hour mode.
 */
void rtc_set_hour_mode(Rtc *p_rtc, uint32_t ul_mode)
{
	if (ul_mode) {
		p_rtc->RTC_MR |= RTC_MR_HRMOD;
	} else {
		p_rtc->RTC_MR &= (~RTC_MR_HRMOD);
	}
}

/**
 * \brief Get the RTC hour mode.
 *
 * \param p_rtc Pointer to an RTC instance.
 *
 * \return 1 for 12-hour mode, 0 for 24-hour mode.
 */
uint32_t rtc_get_hour_mode(Rtc *p_rtc)
{
	uint32_t ul_temp = p_rtc->RTC_MR;

	if (ul_temp & RTC_MR_HRMOD) {
		return 1;
	} else {
		return 0;
	}
}

/**
 * \brief Enable RTC interrupts.
 *
 * \param p_rtc Pointer to an RTC instance.
 * \param ul_sources Interrupts to be enabled.
 */
void rtc_enable_interrupt(Rtc *p_rtc, uint32_t ul_sources)
{
	p_rtc->RTC_IER = ul_sources;
}

/**
 * \brief Disable RTC interrupts.
 *
 * \param p_rtc Pointer to an RTC instance.
 * \param ul_sources Interrupts to be disabled.
 */
void rtc_disable_interrupt(Rtc *p_rtc, uint32_t ul_sources)
{
	p_rtc->RTC_IDR = ul_sources;
}

/**
 * \brief Read RTC interrupt mask.
 *
 * \param p_rtc Pointer to an RTC instance.
 *
 * \return The interrupt mask value.
 */
uint32_t rtc_get_interrupt_mask(Rtc *p_rtc)
{
	return p_rtc->RTC_IMR;
}

/**
 * \brief Get the RTC time value.
 *
 * \param p_rtc Pointer to an RTC instance.
 * \param pul_hour Current hour, 24-hour mode.
 * \param pul_minute Current minute.
 * \param pul_second Current second.
 */
void rtc_get_time(Rtc *p_rtc, uint32_t *pul_hour, uint32_t *pul_minute, uint32_t *pul_second)
{
	uint32_t ul_time;
	uint32_t ul_temp;

	/* Get the current RTC time (multiple reads are necessary to insure a stable value). */
	ul_time = p_rtc->RTC_TIMR;
	while (ul_time != p_rtc->RTC_TIMR) {
		ul_time = p_rtc->RTC_TIMR;
	}

	/* Hour */
	if (pul_hour) {
		ul_temp = (ul_time & RTC_TIMR_HOUR_Msk) >> RTC_TIMR_HOUR_Pos;
		*pul_hour = (ul_temp >> BCD_SHIFT) * BCD_FACTOR + (ul_temp & BCD_MASK);

		if ((ul_time & RTC_TIMR_AMPM) == RTC_TIMR_AMPM) {
			*pul_hour += 12;
		}
	}

	/* Minute */
	if (pul_minute) {
		ul_temp = (ul_time & RTC_TIMR_MIN_Msk) >> RTC_TIMR_MIN_Pos;
		*pul_minute = (ul_temp >> BCD_SHIFT) * BCD_FACTOR +  (ul_temp & BCD_MASK);
	}

	/* Second */
	if (pul_second) {
		ul_temp = (ul_time & RTC_TIMR_SEC_Msk) >> RTC_TIMR_SEC_Pos;
		*pul_second = (ul_temp >> BCD_SHIFT) * BCD_FACTOR + (ul_temp & BCD_MASK);
	}
}

/**
 * \brief Set the RTC time value.
 *
 * \param p_rtc Pointer to an RTC instance.
 * \param ul_hour Current hour, 24-hour mode.
 * \param ul_minute Current minute.
 * \param ul_second Current second.
 *
 * \return 0 for OK, else invalid setting.
 */
uint32_t rtc_set_time(Rtc *p_rtc, uint32_t ul_hour, uint32_t ul_minute, uint32_t ul_second)
{
	uint32_t ul_time;
	uint32_t ul_mask;

	if (p_rtc->RTC_CR & RTC_CR_UPDCAL) {
		p_rtc->RTC_CR &= ~RTC_CR_UPDCAL;
	}

	if (p_rtc->RTC_CR & RTC_CR_UPDTIM) {
		p_rtc->RTC_CR &= ~RTC_CR_UPDTIM;
	}

	/* Update time register. Check the spec for the flow. */
	while ((p_rtc->RTC_SR & RTC_SR_SEC) != RTC_SR_SEC) {
	}

	/* Store Interrupt Mask */
	ul_mask = p_rtc->RTC_IMR;

	/* Disable Interrupts */
	p_rtc->RTC_IDR = 0x3F;

	/* Stops the RTC time counting */
	p_rtc->RTC_CR |= RTC_CR_UPDTIM;
	/* Wait Update flag */
	while ((p_rtc->RTC_SR & RTC_SR_ACKUPD) != RTC_SR_ACKUPD) {
	}

	ul_time = 0xFFFF;
	while (ul_time--);

    /* Acknowledge Clear */
	p_rtc->RTC_SCCR = RTC_SCCR_ACKCLR;

	ul_time = 0;

	/* If 12-hour mode, set AMPM bit */
	if ((p_rtc->RTC_MR & RTC_MR_HRMOD) == RTC_MR_HRMOD) {
		if (ul_hour > 12) {
			ul_hour -= 12;
			ul_time |= RTC_TIMR_AMPM;
		}
	}

	/* Hour */
	ul_time |= ((ul_hour / BCD_FACTOR) << (RTC_TIMR_HOUR_Pos + BCD_SHIFT)) |
			((ul_hour % BCD_FACTOR) << RTC_TIMR_HOUR_Pos);

	/* Minute */
	ul_time |= ((ul_minute / BCD_FACTOR) << (RTC_TIMR_MIN_Pos + BCD_SHIFT)) |
			((ul_minute % BCD_FACTOR) << RTC_TIMR_MIN_Pos);

	/* Second */
	ul_time |= ((ul_second / BCD_FACTOR) << (RTC_TIMR_SEC_Pos + BCD_SHIFT)) |
			((ul_second % BCD_FACTOR) << RTC_TIMR_SEC_Pos);

	/* Set Time */
	p_rtc->RTC_TIMR = ul_time;

	/* Stops the update procedure */
	p_rtc->RTC_CR &= (~RTC_CR_UPDTIM);

	/* Restore Interrupt status */
	p_rtc->RTC_IER = ul_mask;

