ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/asflib/rtc.c
	return (p_rtc->RTC_VER & RTC_VER_NVTIM);
}

/**
 * \brief Set the RTC alarm time value.
 *
 * \param p_rtc Pointer to an RTC instance.
 * \param ul_hour_flag 1 for setting, 0 for not setting.
 * \param ul_hour Alarm hour value, 24-hour mode.
 * \param ul_minute_flag 1 for setting, 0 for not setting.
 * \param ul_minute Alarm minute value.
 * \param ul_second_flag 1 for setting, 0 for not setting.
 * \param ul_second Alarm second value.
 *
 * \return 0 for OK, else invalid setting.
 */
uint32_t rtc_set_time_alarm(Rtc *p_rtc,
		uint32_t ul_hour_flag, uint32_t ul_hour,
		uint32_t ul_minute_flag, uint32_t ul_minute,
		uint32_t ul_second_flag, uint32_t ul_second)
{
	uint32_t ul_alarm = 0;

	/* Hour alarm setting */
	if (ul_hour_flag) {
		/* If 12-hour mode, set AMPM bit */
		if ((p_rtc->RTC_MR & RTC_MR_HRMOD) == RTC_MR_HRMOD) {
			if (ul_hour > 12) {
				ul_hour -= 12;
				ul_alarm |= RTC_TIMALR_AMPM;
			}
		}

		ul_alarm |= RTC_TIMALR_HOUREN | ((ul_hour / BCD_FACTOR) << (RTC_TIMALR_HOUR_Pos + BCD_SHIFT)) |
				((ul_hour % BCD_FACTOR) << RTC_TIMALR_HOUR_Pos);
	}

	/* Minute alarm setting */
	if (ul_minute_flag) {
		ul_alarm |= RTC_TIMALR_MINEN | ((ul_minute / BCD_FACTOR) << (RTC_TIMALR_MIN_Pos + BCD_SHIFT)) |
				((ul_minute % BCD_FACTOR) << RTC_TIMALR_MIN_Pos);
	}

	/* Second alarm setting */
	if (ul_second_flag) {
		ul_alarm |= RTC_TIMALR_SECEN | ((ul_second / BCD_FACTOR) << (RTC_TIMALR_SEC_Pos + BCD_SHIFT)) |
				((ul_second % BCD_FACTOR) << RTC_TIMALR_SEC_Pos);
	}

	p_rtc->RTC_TIMALR &= ~(RTC_TIMALR_SECEN | RTC_TIMALR_MINEN | RTC_TIMALR_HOUREN);
	p_rtc->RTC_TIMALR = ul_alarm;

	return (p_rtc->RTC_VER & RTC_VER_NVTIMALR);
}

/**
 * \brief Get the RTC date value.
 *
 * \param p_rtc Pointer to an RTC instance.
 * \param pul_year Current year.
 * \param pul_month Current month.
 * \param pul_day Current day.
 * \param pul_week Current day in current week.
 */
void rtc_get_date(Rtc *p_rtc, uint32_t *pul_year, uint32_t *pul_month,
		uint32_t *pul_day, uint32_t *pul_week)
{
	uint32_t ul_date;
	uint32_t ul_cent;
	uint32_t ul_temp;

	/* Get the current date (multiple reads are necessary to insure a stable value). */
	ul_date = p_rtc->RTC_CALR;
	while (ul_date != p_rtc->RTC_CALR) {
		ul_date = p_rtc->RTC_CALR;
	}

	/* Retrieve year */
	if (pul_year) {
		ul_temp = (ul_date & RTC_CALR_CENT_Msk) >> RTC_CALR_CENT_Pos;
		ul_cent = (ul_temp >> BCD_SHIFT) * BCD_FACTOR + (ul_temp & BCD_MASK);
		ul_temp = (ul_date & RTC_CALR_YEAR_Msk) >> RTC_CALR_YEAR_Pos;
		*pul_year = (ul_cent * BCD_FACTOR * BCD_FACTOR) +
				(ul_temp >> BCD_SHIFT) * BCD_FACTOR + (ul_temp & BCD_MASK);
	}

	/* Retrieve month */
	if (pul_month) {
		ul_temp = (ul_date & RTC_CALR_MONTH_Msk) >> RTC_CALR_MONTH_Pos;
		*pul_month = (ul_temp >> BCD_SHIFT) * BCD_FACTOR + (ul_temp & BCD_MASK);
	}

	/* Retrieve day */
	if (pul_day) {
		ul_temp = (ul_date & RTC_CALR_DATE_Msk) >> RTC_CALR_DATE_Pos;
		*pul_day = (ul_temp >> BCD_SHIFT) * BCD_FACTOR + (ul_temp & BCD_MASK);
	}

	/* Retrieve week */
	if (pul_week) {
		*pul_week = ((ul_date & RTC_CALR_DAY_Msk) >> RTC_CALR_DAY_Pos);
	}
}

/**
 * \brief Set the RTC date.
 *
 * \param p_rtc Pointer to an RTC instance.
 * \param ul_year Current year.
 * \param ul_month Current month.
 * \param ul_day Current day.
 * \param ul_week Current day in current week.
 *
 * \return 0 for OK, else invalid setting.
 */
uint32_t rtc_set_date(Rtc *p_rtc, uint32_t ul_year, uint32_t ul_month, uint32_t ul_day, uint32_t ul_week)
{
	uint32_t ul_date = 0;

	/* Cent */
	ul_date |= ((ul_year / BCD_FACTOR / BCD_FACTOR / BCD_FACTOR) <<
			(RTC_CALR_CENT_Pos + BCD_SHIFT) |
			((ul_year / BCD_FACTOR / BCD_FACTOR) % BCD_FACTOR) <<  RTC_CALR_CENT_Pos);

	/* Year */
	ul_date |= (((ul_year / BCD_FACTOR) % BCD_FACTOR) <<
			(RTC_CALR_YEAR_Pos + BCD_SHIFT)) |
			((ul_year % BCD_FACTOR) << RTC_CALR_YEAR_Pos);

	/* Month */
	ul_date |= ((ul_month / BCD_FACTOR) << (RTC_CALR_MONTH_Pos + BCD_SHIFT)) |
			((ul_month % BCD_FACTOR) << RTC_CALR_MONTH_Pos);

	/* Week */
	ul_date |= (ul_week << RTC_CALR_DAY_Pos);

	/* Day */
	ul_date |= ((ul_day / BCD_FACTOR) << (RTC_CALR_DATE_Pos + BCD_SHIFT)) |
			((ul_day % BCD_FACTOR) << RTC_CALR_DATE_Pos);

	/* Update calendar register. Check the spec for the flow. */
	while ((p_rtc->RTC_SR & RTC_SR_SEC) != RTC_SR_SEC) {
	}
	p_rtc->RTC_CR |= RTC_CR_UPDCAL;
	while ((p_rtc->RTC_SR & RTC_SR_ACKUPD) != RTC_SR_ACKUPD) {
	}
	p_rtc->RTC_SCCR = RTC_SCCR_ACKCLR;
	p_rtc->RTC_CALR = ul_date;
	p_rtc->RTC_CR &= (~RTC_CR_UPDCAL);

	return (p_rtc->RTC_VER & RTC_VER_NVCAL);
}

/**
 * \brief Set the RTC alarm date value.
 *
 * \param p_rtc Pointer to an RTC instance.
 * \param ul_month_flag 1 for setting, 0 for not setting.
 * \param ul_month Alarm month value.
 * \param ul_day_flag 1 for setting, 0 for not setting.
 * \param ul_day Alarm day value.
 *
 * \return 0 for OK, else invalid setting.
 */
uint32_t rtc_set_date_alarm(Rtc *p_rtc,
		uint32_t ul_month_flag, uint32_t ul_month,
		uint32_t ul_day_flag, uint32_t ul_day)
{
	uint32_t ul_alarm = 0;

	/* Month alarm setting */
	if (ul_month_flag) {
		ul_alarm |= ((ul_month / BCD_FACTOR) << (RTC_CALR_MONTH_Pos + BCD_SHIFT)) |
				((ul_month % BCD_FACTOR) << RTC_CALR_MONTH_Pos);
	}

	/* Day alarm setting */
	if (ul_day_flag) {
		ul_alarm |= ((ul_day / BCD_FACTOR) << (RTC_CALR_DATE_Pos + BCD_SHIFT)) |
				((ul_day % BCD_FACTOR) << RTC_CALR_DATE_Pos);
	}

	/* Set alarm */
	p_rtc->RTC_CALALR &= ~(RTC_CALALR_MTHEN | RTC_CALALR_DATEEN);
	p_rtc->RTC_CALALR = ul_alarm;
	p_rtc->RTC_CALALR |= (RTC_CALALR_MTHEN | RTC_CALALR_DATEEN);

	return (p_rtc->RTC_VER & RTC_VER_NVCALALR);
}

/**
 * \brief Clear the RTC time alarm setting.
 *
 * \param p_rtc Pointer to an RTC instance.
 */
void rtc_clear_time_alarm(Rtc *p_rtc)
{
	p_rtc->RTC_TIMALR = 0;
}

/**
 * \brief Clear the RTC date alarm setting.
 *
 * \param p_rtc Pointer to an RTC instance.
 */
void rtc_clear_date_alarm(Rtc *p_rtc)
{
	/* Need a valid value without enabling */
	p_rtc->RTC_CALALR = RTC_CALALR_MONTH(0x01) | RTC_CALALR_DATE(0x01);
}

/**
 * \brief Get the RTC status.
 *
 * \param p_rtc Pointer to an RTC instance.
 *
 * \return Status of the RTC.
 */
uint32_t rtc_get_status(Rtc *p_rtc)
{
	return (p_rtc->RTC_SR);
}

/**
 * \brief Set the RTC SCCR to clear status bits.
 *
 * \param p_rtc Pointer to an RTC instance.
 * \param ul_clear Some flag bits which will be cleared.
 */
void rtc_clear_status(Rtc *p_rtc, uint32_t ul_clear)
{
	p_rtc->RTC_SCCR = ul_clear;
	while (p_rtc->RTC_SR & ul_clear) {
	}
}

/**
 * \brief Get the RTC valid entry.
 *
 * \param p_rtc Pointer to an RTC instance.
 *
 * \return 0 for no invalid data, else has contained invalid data.
 */
uint32_t rtc_get_valid_entry(Rtc *p_rtc)
{
	return (p_rtc->RTC_VER);
}

/**
 * \brief Set the RTC time event selection.
 *
 * \param p_rtc Pointer to an RTC instance.
 * \param ul_selection Time event selection to be enabled.
 */
void rtc_set_time_event(Rtc *p_rtc, uint32_t ul_selection)
{
	p_rtc->RTC_CR &= ~RTC_CR_TIMEVSEL_Msk;
	p_rtc->RTC_CR |= (ul_selection << RTC_CR_TIMEVSEL_Pos) & RTC_CR_TIMEVSEL_Msk;
}

/**
 * \brief Set the RTC calendar event selection.
 *
 * \param p_rtc Pointer to an RTC instance.
 * \param ul_selection Calendar event selection to be enabled..
 */
void rtc_set_calendar_event(Rtc *p_rtc, uint32_t ul_selection)
{
	p_rtc->RTC_CR &= ~RTC_CR_CALEVSEL_Msk;
	p_rtc->RTC_CR |= (ul_selection << RTC_CR_CALEVSEL_Pos) & RTC_CR_CALEVSEL_Msk;
}

/**
 * \brief Set the RTC calendar mode.
 *
 * \note This function is only available on SAM3S8/3SD8/4S/4N/4C/G and PIC32CX devices.
 *
 * \param p_rtc Pointer to an RTC instance.
 * \param ul_mode 1 for Persian mode,0 for Gregorian mode.
 */
void rtc_set_calendar_mode(Rtc *p_rtc, uint32_t ul_mode)
{
	if (ul_mode) {
		p_rtc->RTC_MR |= RTC_MR_PERSIAN;
	} else {
		p_rtc->RTC_MR &= (~RTC_MR_PERSIAN);
	}
}

/**
 * \brief Get the RTC calendar mode.
 *
 * \note This function is only available on SAM3S8/3SD8/4S/4N/4C/G and PIC32CX devices.
 *
 * \param p_rtc Pointer to an RTC instance.
 *
 * \return 1 for Persian calendar, 0 for Gregorian calendar.
 */
uint32_t rtc_get_calendar_mode(Rtc *p_rtc)
{
	uint32_t ul_temp = p_rtc->RTC_MR;

