ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/asflib/rtc.c
	if (ul_temp & RTC_MR_PERSIAN) {
		return 1;
	} else {
		return 0;
	}
}

/**
 * \brief Set the RTC calibration.
 *
 * \note This function is only available on SAM3S8/3SD8/4S/4N/4C/G and PIC32CX devices.
 *
 * \param p_rtc Pointer to an RTC instance.
 * \param ul_direction_ppm Positive/negative correction.
 * \param ul_correction Correction value.
 * \param ul_range_ppm Low/high range correction.
 */
void rtc_set_calibration(Rtc *p_rtc, uint32_t ul_direction_ppm,
		uint32_t ul_correction, uint32_t ul_range_ppm)
{
	uint32_t ul_temp;

	ul_temp = p_rtc->RTC_MR;

	if (ul_direction_ppm) {
		ul_temp |= RTC_MR_NEGPPM;
	} else {
		ul_temp &= (~RTC_MR_NEGPPM);
	}

	ul_temp &= (~RTC_MR_CORRECTION_Msk);
	ul_temp |= RTC_MR_CORRECTION(ul_correction);

	if (ul_range_ppm) {
		ul_temp |= RTC_MR_HIGHPPM;
	} else {
		ul_temp &= (~RTC_MR_HIGHPPM);
	}

	p_rtc->RTC_MR = ul_temp;
}

/**
 * \brief Set the RTC output waveform.
 *
 * \note This function is only available on SAM3S8/3SD8/4S/4C/G/V/S/E and PIC32CX devices.
 *
 * \param p_rtc Pointer to an RTC instance.
 * \param ul_channel Output channel selection.
 * \param ul_value Output source selection value.
 */
void rtc_set_waveform(Rtc *p_rtc, uint32_t ul_channel, uint32_t ul_value)
{
	if (ul_channel == 0) {
		switch (ul_value) {
		case 0:
			p_rtc->RTC_MR &= ~RTC_MR_OUT0_Msk;
			p_rtc->RTC_MR |= RTC_MR_OUT0_NO_WAVE;
			break;

		case 1:
			p_rtc->RTC_MR &= ~RTC_MR_OUT0_Msk;
			p_rtc->RTC_MR |= RTC_MR_OUT0_FREQ1HZ;
			break;

		case 2:
			p_rtc->RTC_MR &= ~RTC_MR_OUT0_Msk;
			p_rtc->RTC_MR |= RTC_MR_OUT0_FREQ32HZ;
			break;

		case 3:
			p_rtc->RTC_MR &= ~RTC_MR_OUT0_Msk;
			p_rtc->RTC_MR |= RTC_MR_OUT0_FREQ64HZ;
			break;

		case 4:
			p_rtc->RTC_MR &= ~RTC_MR_OUT0_Msk;
			p_rtc->RTC_MR |= RTC_MR_OUT0_FREQ512HZ;
			break;

		case 5:
			p_rtc->RTC_MR &= ~RTC_MR_OUT0_Msk;
			p_rtc->RTC_MR |= RTC_MR_OUT0_ALARM_TOGGLE;
			break;

		case 6:
			p_rtc->RTC_MR &= ~RTC_MR_OUT0_Msk;
			p_rtc->RTC_MR |= RTC_MR_OUT0_ALARM_FLAG;
			break;

		case 7:
			p_rtc->RTC_MR &= ~RTC_MR_OUT0_Msk;
			p_rtc->RTC_MR |= RTC_MR_OUT0_PROG_PULSE;
			break;

		default:
			break;
		}
	} else {
		switch (ul_value) {
		case 0:
			p_rtc->RTC_MR &= ~RTC_MR_OUT1_Msk;
			p_rtc->RTC_MR |= RTC_MR_OUT1_NO_WAVE;
			break;

		case 1:
			p_rtc->RTC_MR &= ~RTC_MR_OUT1_Msk;
			p_rtc->RTC_MR |= RTC_MR_OUT1_FREQ1HZ;
			break;

		case 2:
			p_rtc->RTC_MR &= ~RTC_MR_OUT1_Msk;
			p_rtc->RTC_MR |= RTC_MR_OUT1_FREQ32HZ;
			break;

		case 3:
			p_rtc->RTC_MR &= ~RTC_MR_OUT1_Msk;
			p_rtc->RTC_MR |= RTC_MR_OUT1_FREQ64HZ;
			break;

		case 4:
			p_rtc->RTC_MR &= ~RTC_MR_OUT1_Msk;
			p_rtc->RTC_MR |= RTC_MR_OUT1_FREQ512HZ;
			break;

		case 5:
			p_rtc->RTC_MR &= ~RTC_MR_OUT1_Msk;
			p_rtc->RTC_MR |= RTC_MR_OUT1_ALARM_TOGGLE;
			break;

		case 6:
			p_rtc->RTC_MR &= ~RTC_MR_OUT1_Msk;
			p_rtc->RTC_MR |= RTC_MR_OUT1_ALARM_FLAG;
			break;

		case 7:
			p_rtc->RTC_MR &= ~RTC_MR_OUT1_Msk;
			p_rtc->RTC_MR |= RTC_MR_OUT1_PROG_PULSE;
			break;

		default:
			break;
		}
	}
}

/**
 * \brief Set the pulse output waveform parameters.
 *
 * \note This function is only available on SAM3S8/3SD8/4S/4C/V/S/E and PIC32CX devices.
 *
 * \param p_rtc Pointer to an RTC instance.
 * \param ul_time_high High duration of the output pulse.
 * \param ul_period Period of the output pulse.
 */
void rtc_set_pulse_parameter(Rtc *p_rtc, uint32_t ul_time_high, uint32_t ul_period)
{
	uint32_t ul_temp;

	ul_temp = p_rtc->RTC_MR;

	ul_temp |= (RTC_MR_THIGH_Msk & ((ul_time_high) << RTC_MR_THIGH_Pos));
	ul_temp |= (RTC_MR_TPERIOD_Msk & ((ul_period) << RTC_MR_TPERIOD_Pos));

	p_rtc->RTC_MR = ul_temp;
}

/**
 * \brief Stop the RTC time counting.
 */
void rtc_stop_time_count(Rtc *p_rtc)
{
	p_rtc->RTC_CR |= RTC_CR_UPDTIM;
}

/**
 * \brief Stop the RTC calendar counting.
 */
void rtc_stop_calendar_count(Rtc *p_rtc)
{
	p_rtc->RTC_CR |= RTC_CR_UPDCAL;
}

/**
 * \brief Set the UTC time format.
 *
 * \note This function is only available on PIC32CX devices.
 *
 * \param p_rtc Pointer to an RTC instance.
 */
void rtc_set_utc_time_format(Rtc *p_rtc)
{
	p_rtc->RTC_MR |= RTC_MR_UTC;
}

/**
 * \brief Set the Gregorian/Persian time format.
 *
 * \note This function is only available on PIC32CX devices.
 *
 * \param p_rtc Pointer to an RTC instance.
 */
void rtc_set_gregorian_time_format(Rtc *p_rtc)
{
	p_rtc->RTC_MR &= (~RTC_MR_UTC);
}

/**
 * \brief Get the UTC time format.
 *
 * \note This function is only available on PIC32CX devices.
 *
 * \param p_rtc Pointer to an RTC instance.
 *
 * \return 1 for UTC format, 0 for Gregorian/Persian format.
 */
uint32_t rtc_get_utc_time_format(Rtc *p_rtc)
{
	uint32_t ul_temp = p_rtc->RTC_MR;

	if (ul_temp & RTC_MR_UTC) {
		return 1;
	} else {
		return 0;
	}
}

/**
 * \brief Get the RTC time value in UTC format.
 *
 * \param p_rtc Pointer to an RTC instance.
 * \param pul_utc_time Current UTC time.
 *
 * \return 0 for OK, 1 for invalid UTC mode.
 */
uint32_t rtc_get_utc_time(Rtc *p_rtc, uint32_t *pul_utc_time)
{
	if (p_rtc->RTC_MR & RTC_MR_UTC) {
		/* Get the current RTC time (multiple reads are necessary to insure a stable value). */
		*pul_utc_time = p_rtc->RTC_TIMR;
		while (*pul_utc_time != p_rtc->RTC_TIMR) {
			*pul_utc_time = p_rtc->RTC_TIMR;
		}
		return 0;
	}

	return 1;
}

/**
 * \brief Set the RTC time value in UTC format.
 *
 * \param p_rtc Pointer to an RTC instance.
 * \param ul_utc_time Current UTC time.
 *
 * \return 0 for OK, 1 for invalid UTC mode.
 */
uint32_t rtc_set_utc_time(Rtc *p_rtc, uint32_t ul_utc_time)
{
	if (p_rtc->RTC_MR & RTC_MR_UTC) {
		/* Update time register. Check the spec for the flow. */
		while ((p_rtc->RTC_SR & RTC_SR_SEC) != RTC_SR_SEC) {
		}
		p_rtc->RTC_CR |= RTC_CR_UPDTIM;
		while ((p_rtc->RTC_SR & RTC_SR_ACKUPD) != RTC_SR_ACKUPD) {
		}
		p_rtc->RTC_SCCR = RTC_SCCR_ACKCLR;
		p_rtc->RTC_TIMR = ul_utc_time;
		p_rtc->RTC_CR &= (~RTC_CR_UPDTIM);

		return 0;
	}

	return 1;
}

/**
 * \brief Set the RTC alarm UTC time value.
 *
 * \param p_rtc Pointer to an RTC instance.
 * \param ul_utc_time Alarm UTC time value.
 *
 * \return 0 for OK, 1 for invalid UTC mode.
 */
uint32_t rtc_set_utc_time_alarm(Rtc *p_rtc, uint32_t ul_utc_time)
{
	if (p_rtc->RTC_MR & RTC_MR_UTC) {
		p_rtc->RTC_CALALR &= ~(RTC_CALALR_UTCEN);
		p_rtc->RTC_TIMALR = ul_utc_time;
		p_rtc->RTC_CALALR |= (RTC_CALALR_UTCEN);

