ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/asflib/rtc.c
		return 0;
	}

	return 1;
}

/**
 * \brief Get the UTC time format.
 *
 * \note This function is only available on PIC32CX devices.
 *
 * \note Reading the last stamp of a tamper input clears the whole content of the registers
 *       associated to this tamper input (RTC_FSTRx, RTC_FSDRX, RTC_LSTRx, RTC_LSDRx) and makes
 *       the timestamping registers available to store a new event.
 *
 * \param p_rtc Pointer to an RTC instance.
 * \param b_last_stamp True to get the last stamping time, False to get the first stamping time.
 * \param reg_num Current tamper register set number.
 * \param pul_utc_stamp Pointer to store UTC stamping time.
 *
 * \return 0 for OK, 1 for invalid UTC mode.
 */
uint32_t rtc_get_tamper_utc_time(Rtc *p_rtc, bool b_last_stamp, uint8_t reg_num, uint32_t *pul_utc_stamp)
{
	uint32_t ul_time;

	if (p_rtc->RTC_MR & RTC_MR_UTC) {
		/* Get the last or first stamping time */
		if (b_last_stamp) {
			/* Get the current RTC time (multiple reads are to insure a stable value). */
			ul_time = p_rtc->RTC_SUB0[reg_num].RTC_LSDR;
			while (ul_time != p_rtc->RTC_SUB0[reg_num].RTC_LSDR) {
				ul_time = p_rtc->RTC_SUB0[reg_num].RTC_LSDR;
			}
		} else {
			/* Get the current RTC time (multiple reads are to insure a stable value). */
			ul_time = p_rtc->RTC_SUB0[reg_num].RTC_FSDR;
			while (ul_time != p_rtc->RTC_SUB0[reg_num].RTC_FSDR) {
				ul_time = p_rtc->RTC_SUB0[reg_num].RTC_FSDR;
			}
		}

		*pul_utc_stamp = ul_time;
		return 0;
	} else {
		return 1;
	}
}

/**
 * \brief Enable RTC Tamper inputs.
 *
 * \param p_rtc Pointer to an RTC instance.
 * \param ul_inputs Tamper inputs to be enabled.
 */
void rtc_enable_tamper_input(Rtc *p_rtc, uint32_t ul_inputs)
{
	p_rtc->RTC_TCR |= ul_inputs;
}

/**
 * \brief Disable RTC Tamper inputs.
 *
 * \param p_rtc Pointer to an RTC instance.
 * \param ul_inputs Tamper inputs to be disabled.
 */
void rtc_disable_tamper_input(Rtc *p_rtc, uint32_t ul_inputs)
{
	p_rtc->RTC_TCR &= ~(ul_inputs);
}

/**
 * \brief Enable Tamper clear on GPBR registers.
 *
 * \param p_rtc Pointer to an RTC instance.
 * \param ul_full_clear 1 to clear all GPBRs, 0 to clear GBPR0 to GPBR11.
 */
void rtc_enable_tamper_clear(Rtc *p_rtc, uint32_t ul_full_clear)
{
	p_rtc->RTC_TCR |= RTC_TCR_TAMPCLR;
	if (ul_full_clear) {
		p_rtc->RTC_TCR |= RTC_TCR_FGPBRCLR;
	} else {
		p_rtc->RTC_TCR &= ~(RTC_TCR_FGPBRCLR);
	}
}

/**
 * \brief Disable Tamper clear on GPBR registers.
 *
 * \param p_rtc Pointer to an RTC instance.
 */
void rtc_disable_tamper_clear(Rtc *p_rtc)
{
	p_rtc->RTC_TCR &= ~(RTC_TCR_TAMPCLR);
}

/**
 * \brief Get the RTC tamper input status.
 *
 * \param p_rtc Pointer to an RTC instance.
 *
 * \return Status of the tamper inputs.
 */
uint32_t rtc_get_tamper_input_status(Rtc *p_rtc)
{
	return (p_rtc->RTC_TISR);
}

/**
 * \brief Get the RTC tamper time value.
 *
 * \note This function is only available on PIC32CX devices.
 *
 * \param p_rtc Pointer to an RTC instance.
 * \param b_last_stamp True to get the last stamping time, False to get the first stamping time.
 * \param pul_hour Current hour, 24-hour mode.
 * \param pul_minute Current minute.
 * \param pul_second Current second.
 * \param reg_num Current tamper register set number.
 */
void rtc_get_tamper_time(Rtc *p_rtc, bool b_last_stamp, uint32_t *pul_hour, uint32_t *pul_minute,
		uint32_t *pul_second, uint8_t reg_num)
{
	uint32_t ul_time;
	uint32_t ul_temp;

	/* Get the last or first stamping time */
	if (b_last_stamp) {
		/* Get the current RTC time (multiple reads are to insure a stable value). */
		ul_time = p_rtc->RTC_SUB0[reg_num].RTC_LSTR;
		while (ul_time != p_rtc->RTC_SUB0[reg_num].RTC_LSTR) {
			ul_time = p_rtc->RTC_SUB0[reg_num].RTC_LSTR;
		}
	} else {
		/* Get the current RTC time (multiple reads are to insure a stable value). */
		ul_time = p_rtc->RTC_SUB0[reg_num].RTC_FSTR;
		while (ul_time != p_rtc->RTC_SUB0[reg_num].RTC_FSTR) {
			ul_time = p_rtc->RTC_SUB0[reg_num].RTC_FSTR;
		}
	}

	/* Hour */
	if (pul_hour) {
		ul_temp = (ul_time & RTC_FSTR_HOUR_Msk) >> RTC_FSTR_HOUR_Pos;
		*pul_hour = (ul_temp >> BCD_SHIFT) * BCD_FACTOR + (ul_temp & BCD_MASK);

		if ((ul_time & RTC_FSTR_AMPM) == RTC_FSTR_AMPM) {
			*pul_hour += 12;
		}
	}

	/* Minute */
	if (pul_minute) {
		ul_temp = (ul_time & RTC_FSTR_MIN_Msk) >> RTC_FSTR_MIN_Pos;
		*pul_minute = (ul_temp >> BCD_SHIFT) * BCD_FACTOR + (ul_temp & BCD_MASK);
	}

	/* Second */
	if (pul_second) {
		ul_temp = (ul_time & RTC_FSTR_SEC_Msk) >> RTC_FSTR_SEC_Pos;
		*pul_second = (ul_temp >> BCD_SHIFT) * BCD_FACTOR + (ul_temp & BCD_MASK);
	}
}

/**
 * \brief Get the RTC tamper date.
 *
 * \note This function is only available on PIC32CX devices.
 *
 * \note Reading the last stamp of a tamper input clears the whole content of the registers
 *       associated to this tamper input (RTC_FSTRx, RTC_FSDRX, RTC_LSTRx, RTC_LSDRx) and makes
 *       the timestamping registers available to store a new event.
 *
 * \param p_rtc Pointer to an RTC instance.
 * \param b_last_stamp True to get the last stamping date, False to get the first stamping date.
 * \param pul_year Current year.
 * \param pul_month Current month.
 * \param pul_day Current day.
 * \param pul_week Current day in current week.
 * \param reg_num Current tamper register set number.
 */
void rtc_get_tamper_date(Rtc *p_rtc, bool b_last_stamp, uint32_t *pul_year, uint32_t *pul_month,
		uint32_t *pul_day, uint32_t *pul_week, uint8_t reg_num)
{
	uint32_t ul_date;
	uint32_t ul_cent;
	uint32_t ul_temp;

	/* Get the last or first stamping time */
	if (b_last_stamp) {
		/* Get the current RTC time (cleared by read once). */
		ul_date = p_rtc->RTC_SUB0[reg_num].RTC_LSDR;
	} else {
		/* Get the current RTC time (multiple reads are to insure a stable value). */
		ul_date = p_rtc->RTC_SUB0[reg_num].RTC_FSDR;
		while (ul_date != p_rtc->RTC_SUB0[reg_num].RTC_FSDR) {
			ul_date = p_rtc->RTC_SUB0[reg_num].RTC_FSDR;
		}
	}

	/* Retrieve year */
	if (pul_year) {
		ul_temp = (ul_date & RTC_FSDR_CENT_Msk) >> RTC_FSDR_CENT_Pos;
		ul_cent = (ul_temp >> BCD_SHIFT) * BCD_FACTOR + (ul_temp & BCD_MASK);
		ul_temp = (ul_date & RTC_FSDR_YEAR_Msk) >> RTC_FSDR_YEAR_Pos;
		*pul_year = (ul_cent * BCD_FACTOR * BCD_FACTOR) +
				(ul_temp >> BCD_SHIFT) * BCD_FACTOR + (ul_temp & BCD_MASK);
	}

