ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/asflib/rtc.c
	/* Retrieve month */
	if (pul_month) {
		ul_temp = (ul_date & RTC_FSDR_MONTH_Msk) >> RTC_FSDR_MONTH_Pos;
		*pul_month = (ul_temp >> BCD_SHIFT) * BCD_FACTOR + (ul_temp & BCD_MASK);
	}

	/* Retrieve day */
	if (pul_day) {
		ul_temp = (ul_date & RTC_FSDR_DATE_Msk) >> RTC_FSDR_DATE_Pos;
		*pul_day = (ul_temp >> BCD_SHIFT) * BCD_FACTOR + (ul_temp & BCD_MASK);
	}

	/* Retrieve week */
	if (pul_week) {
		*pul_week = ((ul_date & RTC_FSDR_DAY_Msk) >> RTC_FSDR_DAY_Pos);
	}
}

/**
 * \brief Get the RTC tamper event counter.
 *
 * \note This function is only available on PIC32CX devices.
 *
 * \note This function should be called before rtc_get_tamper_date()
 *       function call using last date stamping, Otherwise the tamper event counter will be cleared.
 *
 * \param p_rtc Pointer to an RTC instance.
 * \param reg_num Current tamper register set number.
 *
 * \return Tamper event counter
 */
uint32_t rtc_get_tamper_event_counter(Rtc *p_rtc, uint8_t reg_num)
{
	return (p_rtc->RTC_SUB0[reg_num].RTC_FSTR & RTC_FSTR_TEVCNT_Msk) >> RTC_FSTR_TEVCNT_Pos;
}

/**
 * \brief Check the system is in backup mode when RTC tamper event happen.
 *
 * \note This function is only available on PIC32CX devices.
 *
 * \note This function should be called before rtc_get_tamper_date()
 *       function call using last date stamping, Otherwise the flag indicates tamper occur in backup
 *       mode will be cleared.
 *
 * \param p_rtc Pointer to an RTC instance.
 * \param b_last_stamp True to get the last stamping date, False to get the first stamping date.
 * \param reg_num Current tamper register set number.
 *
 * \return True - The system is in backup mode when the tamper event occurs.
 *         Flase - The system is different from backup mode.
 */
bool rtc_is_tamper_occur_in_backup_mode(Rtc *p_rtc, bool b_last_stamp, uint8_t reg_num)
{
	/* Get the last or first stamping time */
	if (b_last_stamp) {
		if (p_rtc->RTC_SUB0[reg_num].RTC_LSTR & RTC_LSTR_BACKUP) {
			return true;
		} else {
			return false;
		}
	} else {
		if (p_rtc->RTC_SUB0[reg_num].RTC_LSTR & RTC_LSTR_BACKUP) {
			return true;
		} else {
			return false;
		}
	}
}

/* @} */

/* / @cond 0 */
/**INDENT-OFF**/
#ifdef __cplusplus
}
#endif
/**INDENT-ON**/
/* / @endcond */
